olonsoft/esp8266-Gill-anemometer/src/common.h
  wifiManager.setTimeout(120);  //(in seconds) sets timeout until configuration
                                //portal gets turned off

  // it starts an access point with the specified name
  // here  "AutoConnectAP"
  // and goes into a blocking loop awaiting configuration

  // WITHOUT THIS THE AP DOES NOT SEEM TO WORK PROPERLY WITH SDK 1.5 , update to
  // at least 1.5.1 WiFi.mode(WIFI_STA);

  if (!wifiManager.startConfigPortal((char *)APP_NAME)) {
    TDEBUG_PRINTF_P("failed to connect and hit timeout\n");
    restartESP();
  }
  // if you get here you have connected to the WiFi
  TDEBUG_PRINTF_P("connected...yeey :)\n");
  WiFi.printDiag(Serial);
  // save SSID and password to flash
  strcpy(appSettings.ssid, WiFi.SSID().c_str());
  strcpy(appSettings.password, WiFi.psk().c_str());
  // save mqtt settings to flash
  strcpy(appSettings.mqttBroker, custom_mqtt_broker.getValue());
  appSettings.mqttPort = atoi(custom_mqtt_port.getValue());
  strcpy(appSettings.mqttUser, custom_mqtt_user.getValue());
  strcpy(appSettings.mqttPass, custom_mqtt_password.getValue());
  strcpy(appSettings.mqttTopic, custom_mqtt_topic.getValue());
  appSettings.mqttTopicDataInterval = atoi(custom_mqtt_update.getValue());
  debugConfig();
  saveConfig();  // save configuration and restart esp
  restartESP();
}

void wifiLoop() {
  if (!captivePortal) {
    jw.loop();
    if (jw.connected()) {
      FOTA_Loop();  // check for firmware updates
    }
  } else {
    startWiFiManager();
  }
}

void appLoop() {
#ifdef OLED1306
  _oledLoop();
#endif

#ifdef MQTT_ENABLED
  // check for messages every second
  if (millis() - _lastMQTTloop > 1000) {
    _lastMQTTloop = millis();
    _mqttLoop();
  }
#endif
}
